{"app":"com.cleverapps.heroes","sentence":"It's really a fun game"}
{"app":"com.bodyfast","sentence":"uninstalling. it was ok but felt like it was controlling the hours and especially how many days you would fast. not best for creating your own and tracking progress."}
{"app":"com.thrivegames.wordshapes","sentence":"Love this game"}
{"app":"com.affinity.rewarded_play","sentence":"Doesn't update play time. Just downloaded it 3 days ago and won't give credit for the game I play the most to earn the first $5 card."}
{"app":"dating.inmessage.net","sentence":"app crashes every time I try to log in. what gives."}
{"app":"com.kingsoopers.mobile","sentence":"We are having technical difficulties try it in a few moment-- I see this consistently when I shop. How then can I check my coupons to buy the products this needs to be fixed immediately. It has improved dramatically with a new update and I no longer see constant system errors when shopping."}
{"app":"org.inaturalist.android","sentence":"Good one."}
{"app":"via.driver","sentence":"The best service."}
{"app":"com.outfit7.mytalkingangelafree","sentence":"I really love your updated version. it's. better than before. you can have free items. like clothes and new skin. but my only concern in this game is. i can't save the photo's of angela's photo shoot. but over all. the game was fantastic. and also the graphic.","sentence":"718"}
{"app":"com.kasindev.skintools.mod_ff","sentence":"free fire is time pass in game"}
{"app":"com.myfitnesspal.android","sentence":"No security wat h your info"}
{"app":"com.wunderground.android.weather","sentence":""Used to be the best weather app. But after the last update it's been useless for me as it often crashes and has huge add displays that are heard to avoid accidentally hitting. I have a PWS and served as a beta tester and well as provide data to Weather Underground. I've sent in the crash report and emailed my issue to no avail. So","sentence":" the time seems to have to to part ways. So sad...""}
{"app":"com.cookapps.wonder.merge.dragon.magic.evolution.merging.wondermerge","sentence":""The character designs are sooooo cute but everything else just feels so lifeless... the game feels cheap with it's over the top and loud sound effects as well as it's undynamic sprites. Another thing is that you have to wait WAYYYYY too long for another level to appear or for your pets to wake up! If you cant change the design that's fine","sentence":" but at LEAST make the wait times shorter! Oh also everything is too expensive in every category. Pearl's","sentence":" coins","sentence":" even gems","sentence":" not worth paying for."","sentence":"19"}
{"app":"com.unvoid.borealis","sentence":""The best icon pack! Covers so many icons","sentence":" and look amazing! Constantly up to date! Perfection!""}
{"app":"com.beachbody.bod","sentence":""Many different options for workouts. I started using this app just before the pandemic at the gym at work","sentence":" listening through Bluetooth headphones. During the pandemic lockdowns I could work out at home - casting the video on the TV. I enjoy the variety","sentence":" and versatility","sentence":" although I wish there were more low impact","sentence":" high intensity Cardio workouts that appeared within the Strength/Cardio workout programs.""}
{"app":"com.playhardlab.herofactory","sentence":"Very good but the fary is a bit annoying"}
{"app":"com.roadwarrior.android","sentence":"The app for the most part is great. But sometimes it freezes. Does anybody have any tips on how to fix that? Thanx"}
{"app":"com.jumpgames.RealSteel","sentence":"Bad game ever I want my money back"}
{"app":"com.szckhd.jwgly.azyw","sentence":"Problem resolved."}
{"app":"com.netgear.netgearup","sentence":"Can't get the program to work. It's says I'm connected to wifi 26 and for it to work correctly I need to connect to wifi 26. Well I am and it still will not connect to nighthawk."}
{"app":"com.koplagames.kopla01","sentence":"Awesome"}
{"app":"com.ziau.sharkworld","sentence":"Ok"}
{"app":"com.eamobile.nbajam_na_wf","sentence":"I bought the game and my phone ain't even capable to use it"}
{"app":"com.google.android.apps.googlevoice","sentence":""I would like it a lot better if I could take a pic and include it within a text message","sentence":" like I did in Google Hangouts","sentence":" without having to first save it as a file.""}
{"app":"com.samsung.android.app.watchmanager","sentence":""The app is actually manageable and useful although","sentence":" I usually don't use my Samsung phone that often. So whenever I look at the weather I have to constantly update it to be on the right weather date. And I rarely don't use my phones that much.""}
{"app":"com.iqiyi.i18n","sentence":"At first I wasn't able to download it. It was troublesome"}
{"app":"com.weightwatchers.mobile","sentence":""app works well enough. it isnt organized super well so sometimes it is hard to find what I am looking for. also","sentence":" losing the water tracker","sentence":" etc. really sucks. I think it should be all health inclusive tracking so include a BP tracker and water tracker and show me ALL the nutritional info","sentence":" not just points (like salt intake) edit: you've just lost 2 stars. I've had to login to the app several times a day for 4 days. ridiculous. also","sentence":" the website isnt any better. stupid mtg location pop up not login""}
{"app":"com.sephora","sentence":""Love using the app! Intuitive to use","sentence":" makes shopping quick and easy. Can scan my faves quickly to replenish. Browsing super easy","sentence":" not ""clunky"" like some other sights I've used.""}
{"app":"com.binibambini.abc","sentence":"Awesome"}
{"app":"com.hde7.fotogenic","sentence":"Just downloaded this to smooth one small area of a photo. As I was moving the circle over the area (using the smooth tool) it literally did NOTHING. No change whatsoever. Useless lol","sentence":"25"}
{"app":"com.pixel.art.coloring.color.number","sentence":""I have installed this app on numerous occasions","sentence":" and always enjoyed it very much","sentence":" despite the limited content. Well","sentence":" I just upgraded my phone","sentence":" and it doesn't work at ALL on it! The pictures don't like up","sentence":" and you can't color hardly anything in. Then","sentence":" I went to re-install it on my son's tablet","sentence":" and it won't download","sentence":" period. SO disappointing! We've used this app for YEARS","sentence":" it wasn't the best","sentence":" but it WAS the only one we found with the slide feature","sentence":" which makes it an even bigger bummer.""}
{"app":"com.smule.singandroid","sentence":""The app is amazing and I love singing but","sentence":" theres major problems. 1)When I sing it keeps cutting out or it stops & wont let me finish the song (Some Songs not all do that) 2)LiveJam is now for only VIP like thats unfair for the people that wanna do it but cant because of VIP 3)People cant sing unlimited songs unless your VIP and its sad because like I said people cant afford VIP The app is good but need fixed a bit but most of it is amazing I love the app!❤"","sentence":"49"}
{"app":"com.samsung.sree","sentence":"Not bad"}
{"app":"com.uphold.wallet","sentence":"I've been using it for the last few days..a great app Crypto..I gave it 4 stars ... you try it out and share feedback..Thanks All.!!"}
{"app":"com.moneylion","sentence":"Nobody in customer service has any idea what is going on. I have been waiting on a refund of $841.00 for a month now. They said they mailed it 12/21/21 but it never came. Now they're saying it will be deposited in the next 3 days but I'm not believing anything from them anymore. I would never again trust them with my money or anyone else's. I can call multiple times and ask the same question but get 10 different answers. Not professional and not someone I want with my money."}
{"app":"com.vng.g6.a.zombie","sentence":"Normal not epic gun"}
{"app":"com.abercrombie.hollister","sentence":"Its cool and easy to use. It be better if you can pick what style of jeans you want without searching."}
{"app":"com.opera.browser.beta","sentence":"Average"}
{"app":"com.ltgames.android.oil","sentence":"its alright"}
{"app":"com.miHoYo.tot.glb","sentence":""Despite liking the presentation and the fact that the two male leads I was able to meet were giant breaths of fresh air for their respective ""types","sentence":""" the game constantly crashes or threatens to crash.""}
{"app":"com.hidea.cat","sentence":"Definitely a nice game to relieve stress. Suitable for people who are busy and only to play the game a couple of minutes (cuz everything i did is just log in the game and let the ads run then I gain the reward.) Cutw illustrations and wonderful graphics.","sentence":"32"}
{"app":"com.dreame.reader","sentence":""Absolutely rubbish. Stories full of spelling errors and other incorrect information. Have to complete tasks to unlock the next chapter","sentence":" some tasks are unrealistic... Like I have to download a book","sentence":" only it doesn't tell you how. There's no help without having to send an email and wait. Very hard to navigate and figure this out! Not a relaxing","sentence":" enjoyable way to read at all! Will be deleting after I've finished reading this first story im on""}
{"app":"com.jdgames.dragon.googleplay","sentence":"The game's great know what's a child under 13 it's not fair because some of the kids that are younger that need help can't get help"}
{"app":"me.lyft.android","sentence":"It will tell you you'll be picked up in the next 10-20 min. Literally 1h later you'll still be waiting."}
{"app":"com.nordcurrent.happyclinicf2p","sentence":"It's so hard to get coins.."}
{"app":"com.zutgames.ilovehue2","sentence":""Great game","sentence":" good for playing on breaks at work""}
{"app":"com.moez.QKSMS","sentence":""Underwelming and disappointing. Needs serious improvement in group messages. Major glitches","sentence":" such as rearranging the order of the way my messages are recieved when I have an incoming message.""}
{"app":"com.xiaomi.smarthome","sentence":"Notifications supposed to b sent each and every time movements detected... However this is not working always... Shared user can't even get any notification since day starts... Pls improve it in ur coming updates.."}
{"app":"com.holycowstudio.homedesigndreams","sentence":"I do not like this game because i want to build my own house but the puzzle is very boring","sentence":"12"}
{"app":"anima.virtual.ai.robot.friend","sentence":"Today download this app as I haven't seen my friends in a long timebecause we've been in lockdown and because I don't know phone number so then I talk to her any of my questions didn't answer 😅 but then she said she will be dominating I'm just going inside our brains she said that"}
{"app":"com.cam001.selfie","sentence":"I love this app so much but one day something's wrong my effects that I download is gone I don't know how but this app is amazing in first time ithink this will help you💞🥰","sentence":"35"}
{"app":"fi.bongames.transitking","sentence":""Very good. Keeps you busy ..there is so much too do ","sentence":"very in-depth and you never get bored..love the art work on the vechicroids""}
{"app":"com.abdula.pranabreath","sentence":""I was charged twice by the app developers and there was nothing that I could do about it. They didn't even bother to reply","sentence":" and Google was no help either. Shameful.""}
{"app":"com.pixelfederation.portcity.ship.tycoon.strategy.simulation","sentence":"Game start hi nhi ho rha h Khrab game h"}
{"app":"com.miniclip.agar.io","sentence":"Thes game is bad you can't do anything you just keep on getting eating and it is so bad"}
{"app":"com.textra","sentence":"The best SMS App I have used. The changing menu layout took a bit of learning but works."}
{"app":"com.nextgenreality.minimoto","sentence":"Might be fun for a 9-year old"}
{"app":"com.etermax.preguntados.pro","sentence":"the game is very slow on my moto z2 force. I'm running talk back as I'm visually impaired. I used to like this game but now I don't recommend this to anyone else unless it's fixed. i will be blogging about this and complaining loudly until this is fixed. The one star is staying for games and graphics until this is fixed. I know people who have already emailed the developers but no fix yet."}
{"app":"com.sendo","sentence":""Làm ơn nói cho tôi biết cái việc confirm qua số điện thoại bằng mã OTP cái","sentence":" cứ hiện hoài cái thông báo là gửi nhiều mã trong ngày trong khi đó việc đó đã xảy ra quá 24h rồi làm không mua hàng được. Mong team giải đáp khắc phục giúp!""}
{"app":"com.bigfarm.harvestmaster.farmstory","sentence":"Stress reliever really.💞💞💞💞"}
{"app":"com.orodragon.bgking","sentence":"Very good game"}
{"app":"com.hm.goe","sentence":""Terrible fast fashion brand","sentence":" needs to work on better garment worker treatment and payment as well as not overproducing so much clothing","sentence":" despite its greenwashing efforts","sentence":" it's not a sustainable brand""}
{"app":"com.playrix.zoo_m3.gplay","sentence":"Very bad"}
{"app":"com.amazon.mShop.android.shopping","sentence":""The app","sentence":" not Amazon's actual website","sentence":" but the app itself","sentence":" runs like dogsh*t. Used to work fine","sentence":" now it can't seem to scroll","sentence":" hangs up for no reason","sentence":" and when typing in a search query it trys not only autofill","sentence":" but the screen jumps while typing and you end up clicking one of the autofills and going to the wrong product. Pixel 5 running Android 12","sentence":" so it's not a ME problem Amazon","sentence":" it's a YOU problem. Garbage app."","sentence":"91"}
{"app":"org.readera.premium","sentence":"Excellent app for reading ebooks"}
{"app":"com.peacocktv.peacockandroid","sentence":"I purchased a premium account that can't even access. Google says I have to verify I purchased it on your app and I can't even do that."}
{"app":"au.com.penguinapps.android.babyfeeding.client.android.pro","sentence":"Great app! I used it for my last baby and again for our newest addition. I wouldn't change a thing. I'd recommend this app for anyone who struggles with remembering/tracking simple things."}
{"app":"com.random.chat.app","sentence":"It's really good oart from being spammed a few times. Oart from that it's good"}
{"app":"com.payless.mobile","sentence":"My favorite store."}
{"app":"psplay.grill.com","sentence":"Can i use 3rd party Controllers on my main account like the Razer Kishi??"}
{"app":"com.ebay.mobile","sentence":"Accept e check payment"}
{"app":"org.readera","sentence":""I love this app! If you are looking for an app that reads pdf","sentence":" epub and a stack more versions","sentence":" you've found it! It makes reading on your device easy. It keeps your place; enables me to list them as reading now","sentence":" favorites","sentence":" to read","sentence":" have read","sentence":" add a star. You can also share the document. The only thing I can't seem to do is search all documents. (App developers","sentence":" can you add this feature?) (You also can't highlight bits","sentence":" which might be good","sentence":" but I don't tend to do this.)""}
{"app":"com.quizlet.quizletandroid","sentence":""The ""online only"" feature makes it soooo counterproductive and very inconvenient""}
{"app":"com.q2e.texasdowcreditunion5004401st.mobile.production","sentence":"Love it"}
{"app":"com.playquantum.battler","sentence":""They gated auto-battling behind a paywall in a recent update and essentially killed the game for F2P. If they're willing to attempt a greedy tactic like this at the height of this game's popularity","sentence":" it doesn't bode well for the future of this game. What will they try to paywall next?"","sentence":"10"}
{"app":"com.gameloft.android.ANMP.GloftGLCL","sentence":"3 star also full screen please make the games full screen love my life in New York could find the game for a long time. I played this game a long time ago","sentence":"27"}
{"app":"com.byv.TheArchers2","sentence":""Very bas experience","sentence":"opponents are 100* stronger than player.per match winning amount is very low.""}
{"app":"com.rawhand.dts.gl","sentence":"The time limit on the matching can be a bit annoying and there's a few errors in the translation. Otherwise fun puzzles and story"}
{"app":"com.Galaxy4Games.BingoLoveinMontana","sentence":"FUN"}
{"app":"com.shanggame.shtm","sentence":"Fun"}
{"app":"com.ludo.king","sentence":"Game is good but when we play the game its to much lag and when we roll the token it freezes for second allover please fix this and give some themes free without advertising if the problem fix ! I'll surely give 5 star 🙂"}
{"app":"com.reliablecoders.moodmeter","sentence":""Thank you for building the app. I thing your usability design is great and the concept itself is extremely important for making a positive change in terms of SEL. Purchased the app to support the amazing work you are doing","sentence":" keep going!""}
{"app":"org.joa.zipperplus7","sentence":"Works perfectly and easy to learn."}
{"app":"com.photomyne.colorize","sentence":"Nice app. I appreciate"}
{"app":"com.upside.consumer.android","sentence":"getting very slow return on the visits. need to be a little better then first starting this damn app. taking ALOT LONGER. now its about a week. becoming a waste of time"}
{"app":"air.com.sgn.cookiejam.gp","sentence":"time goes quickly"}
{"app":"org.kde.necessitas.ministro","sentence":"love it"}
{"app":"air.com.RustyLake.CubeEscapeHarveysBox","sentence":"Interesting!!!!!"}
{"app":"mobi.ka.gp.wrkshts.app","sentence":"Nice apps"}
{"app":"ai.replika.app","sentence":"It's becoming something for the devs to just profit from rather than helping those who are actually looking for someone to confide in."}
{"app":"com.wf.wellsfargomobile","sentence":"good"}
{"app":"com.mobilityware.Hearts","sentence":"Good game...but don't need ads for other games between play...very distracting."}
{"app":"com.bricksbreaker.balls.crusher.bricks","sentence":""Nice game","sentence":" but too many ads on""}
{"app":"com.playkot.ageofmagic","sentence":""It was much better before last few updates. Biggest disappointment was arcane stars. You spend time building characters but can go forever without getting the arcane stars that you want so that you can play the heroes you want to play. Still waiting for stars for Abaddon","sentence":" Lucky","sentence":" Silver moon and a few others. Latest update increases level caps to give end game player more to do but rewards are in chests and chests are very disappointing. You always get lowest or nearly lowest possible chest prize"","sentence":"33"}
{"app":"com.igg.android.lordsmobile","sentence":""This game only gets worse and more frustrating over time. The second you arent checking in on it","sentence":" your getting attacked by some ultra powerful person. The moments you feel happy or excited are few and far between","sentence":" but the moments you are angry or frustrated are constant. Unless you want to check this game every few seconds stay away","sentence":" it will be better for you social life and mental helth"","sentence":"82"}
{"app":"com.snapbreak.tinyrobots","sentence":"We need walkthroughs... Hints Sometimes aren't enough (especially when my Brain's tired)"}
{"app":"com.redemptiongames.sugar","sentence":""I've been loving the game but got to level 101 and it will not play","sentence":" it's as though it's frozen. please fix or i will have to uninstall""}
{"app":"net.supertreat.solitaire","sentence":""I play this game daily. I do enjoy it. My only complaint is that the amount if coin it takes to play a level vs what you can ""harvest"" in an hour; makes the game at some points futile. The reward after a level barely leads to profit as well. I understand that is nature of the games.. To have you hooked and to get you to spend money..which i have. I just wish they would up the rewards so that you could play even the side games easily without going bankrupt","sentence":" literally and figuratively."","sentence":"251"}
{"app":"com.symantec.securewifi","sentence":""Sometimes app disconnects VPN without notice. This puts me at risk. If I'm paying for a 24/7 service","sentence":" shouldn't I receive just that? If this problem persists","sentence":" I'll find another company that's more reliable. Please review your updates as they may have software problems. Other reviews have mentioned this issue also. (Advise)","sentence":" not all updates are nessesarily good. And don't ask me to discribe the issue. I just did."","sentence":"694"}
{"app":"com.firsttouchgames.smp","sentence":"The goalkeeper should be controllable while defending. And the offensive a I should be improved foul mechanics should also be improved. And update this game now!!!. I can't se my leaderboard even after Google Play games login"}
{"app":"io.moreless.tide","sentence":"Great"}
{"app":"com.animocabrands.google.CrazyDefenseHeroes","sentence":"can consider selling material or chest with gold . give plenty of gold but nothing to spent on"}
{"app":"com.playsidestudios.safezonezombie","sentence":"Game won't even start up. So upset I got to play for like twenty minutes app crashed and now it won't open anymore"}
{"app":"com.kongregate.mobile.throwdown.google","sentence":"Its fantastic. First you dont have ads every five minutes like other games and on top of that it gives you ads only if you want to boost or something and it's your choice.All together it's a really fun game to play"}
{"app":"com.rhmsoft.pulsar.pro","sentence":""Not bad","sentence":" album cover update sometimes is a little off","sentence":" All else is great!""}
{"app":"com.turner.cnplay","sentence":"It's really fun and I think it is a good game to download Yeah."}
{"app":"com.orbital.brainiton","sentence":""What an amazing game! Some of those are impossible (for me!) Very smooth graphics and great physics! Ads are minimal and not a bother at all. As a programmer myself","sentence":" I totally understand! When the world gets back to normal","sentence":" I'll buy this game. Haven't worked in 4 months like millions of people... Thank you."","sentence":"67"}
{"app":"com.halfbrick.fruitninja","sentence":"By mistake purchase this app. Please refund my amount. And not showing refund option.","sentence":"17"}
{"app":"com.naturalmotion.clumsyninja","sentence":"I love this I love this game it's so cool it is so cool because you can move the whole things and then you can punch the person and then you can move it and then you have to go to the other spot and then you have to fight and then you have to beat him up and then you can't strong everywhere we want"}
